# ####################################################################

#  Created by Genus(TM) Synthesis Solution 19.12-s121_1 on Tue Apr 01 15:34:07 CST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1fF
set_units -time 1ps

# Set the current design
current_design MultTop

create_clock -name "clock" -period 1500.0 -waveform {0.0 750.0} [get_ports clock]
set_clock_groups -name "clock_groups_clock_to_others" -asynchronous -group [get_clocks clock]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports reset]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[15]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[14]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[13]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[12]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[11]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[10]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[9]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[8]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[7]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[6]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[5]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[4]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[3]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[2]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[1]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplicand[0]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[15]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[14]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[13]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[12]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[11]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[10]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[9]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[8]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[7]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[6]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[5]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[4]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[3]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[2]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[1]}]
set_input_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {multiplier[0]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[31]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[30]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[29]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[28]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[27]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[26]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[25]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[24]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[23]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[22]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[21]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[20]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[19]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[18]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[17]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[16]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[15]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[14]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[13]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[12]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[11]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[10]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[9]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[8]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[7]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[6]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[5]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[4]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[3]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[2]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[1]}]
set_output_delay -clock [get_clocks clock] -add_delay 150.0 [get_ports {product[0]}]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_RVT_TT_nldm_201020/A2O1A1O1Ixp25_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_RVT_TT_nldm_201020/AO21x1_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_RVT_TT_nldm_201020/AO21x2_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_RVT_TT_nldm_201020/AOI211xp5_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_RVT_TT_nldm_201020/AOI32xp33_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_LVT_TT_nldm_201020/A2O1A1O1Ixp25_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_LVT_TT_nldm_201020/AO21x1_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_LVT_TT_nldm_201020/AO21x2_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_LVT_TT_nldm_201020/AOI211xp5_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_LVT_TT_nldm_201020/AOI32xp33_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SLVT_TT_nldm_201020/A2O1A1O1Ixp25_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SLVT_TT_nldm_201020/AO21x1_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SLVT_TT_nldm_201020/AO21x2_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SLVT_TT_nldm_201020/AOI211xp5_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SLVT_TT_nldm_201020/AOI32xp33_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SRAM_TT_nldm_201020/A2O1A1O1Ixp25_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SRAM_TT_nldm_201020/AO21x1_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SRAM_TT_nldm_201020/AO21x2_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SRAM_TT_nldm_201020/AOI211xp5_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_AO_SRAM_TT_nldm_201020/AOI32xp33_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_LVT_TT_nldm_201020/OAI21x1_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_LVT_TT_nldm_201020/OAI221xp5_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_LVT_TT_nldm_201020/OAI31xp33_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_LVT_TT_nldm_201020/OAI31xp67_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_LVT_TT_nldm_201020/OAI322xp33_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_LVT_TT_nldm_201020/OAI32xp33_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_LVT_TT_nldm_201020/OAI33xp33_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_RVT_TT_nldm_201020/OAI21x1_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_RVT_TT_nldm_201020/OAI221xp5_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_RVT_TT_nldm_201020/OAI31xp33_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_RVT_TT_nldm_201020/OAI31xp67_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_RVT_TT_nldm_201020/OAI322xp33_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_RVT_TT_nldm_201020/OAI32xp33_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_RVT_TT_nldm_201020/OAI33xp33_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SLVT_TT_nldm_201020/OAI21x1_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SLVT_TT_nldm_201020/OAI221xp5_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SLVT_TT_nldm_201020/OAI31xp33_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SLVT_TT_nldm_201020/OAI31xp67_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SLVT_TT_nldm_201020/OAI322xp33_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SLVT_TT_nldm_201020/OAI32xp33_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SLVT_TT_nldm_201020/OAI33xp33_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SRAM_TT_nldm_201020/OAI21x1_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SRAM_TT_nldm_201020/OAI221xp5_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SRAM_TT_nldm_201020/OAI31xp33_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SRAM_TT_nldm_201020/OAI31xp67_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SRAM_TT_nldm_201020/OAI322xp33_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SRAM_TT_nldm_201020/OAI32xp33_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_OA_SRAM_TT_nldm_201020/OAI33xp33_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_TT_nldm_201020/ICGx2p67DC_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_TT_nldm_201020/ICGx4DC_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_TT_nldm_201020/ICGx5p33DC_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_TT_nldm_201020/ICGx6p67DC_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_TT_nldm_201020/ICGx8DC_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_TT_nldm_201020/SDFLx1_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_TT_nldm_201020/SDFLx2_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_LVT_TT_nldm_201020/SDFLx3_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_TT_nldm_201020/ICGx2p67DC_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_TT_nldm_201020/ICGx4DC_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_TT_nldm_201020/ICGx5p33DC_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_TT_nldm_201020/ICGx6p67DC_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_TT_nldm_201020/ICGx8DC_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_TT_nldm_201020/SDFLx1_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_TT_nldm_201020/SDFLx2_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_RVT_TT_nldm_201020/SDFLx3_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_TT_nldm_201020/ICGx2p67DC_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_TT_nldm_201020/ICGx4DC_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_TT_nldm_201020/ICGx5p33DC_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_TT_nldm_201020/ICGx6p67DC_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_TT_nldm_201020/ICGx8DC_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_TT_nldm_201020/SDFLx1_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_TT_nldm_201020/SDFLx2_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SLVT_TT_nldm_201020/SDFLx3_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_TT_nldm_201020/ICGx2p67DC_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_TT_nldm_201020/ICGx4DC_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_TT_nldm_201020/ICGx5p33DC_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_TT_nldm_201020/ICGx6p67DC_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_TT_nldm_201020/ICGx8DC_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_TT_nldm_201020/SDFLx1_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_TT_nldm_201020/SDFLx2_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SEQ_SRAM_TT_nldm_201020/SDFLx3_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_LVT_TT_nldm_201020/AND4x1_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_LVT_TT_nldm_201020/FAx1_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_LVT_TT_nldm_201020/OR2x6_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_LVT_TT_nldm_201020/XNOR2x1_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_LVT_TT_nldm_201020/XOR2x2_ASAP7_75t_L]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_RVT_TT_nldm_201020/AND4x1_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_RVT_TT_nldm_201020/FAx1_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_RVT_TT_nldm_201020/OR2x6_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_RVT_TT_nldm_201020/XNOR2x1_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_RVT_TT_nldm_201020/XOR2x2_ASAP7_75t_R]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SLVT_TT_nldm_201020/AND4x1_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SLVT_TT_nldm_201020/FAx1_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SLVT_TT_nldm_201020/OR2x6_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SLVT_TT_nldm_201020/XNOR2x1_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SLVT_TT_nldm_201020/XOR2x2_ASAP7_75t_SL]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SRAM_TT_nldm_201020/AND4x1_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SRAM_TT_nldm_201020/FAx1_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SRAM_TT_nldm_201020/OR2x6_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SRAM_TT_nldm_201020/XNOR2x1_ASAP7_75t_SRAM]
set_dont_use true [get_lib_cells asap7sc7p5t_SIMPLE_SRAM_TT_nldm_201020/XOR2x2_ASAP7_75t_SRAM]
